{
  "backend/main.mo": "Motoko canister implementing admin-protected product CRUD and user profile storage with access control and external blob handling.",
  "feature_evidence.json": "Feature evidence report listing feature IDs, affected files, components, and test references for recent frontend fixes.",
  "frontend-file-summaries.txt": "Prewritten summaries of numerous frontend files describing their roles in UI, product management, hooks, and utilities.",
  "frontend/index.css": "Global Tailwind-based OKLCH color theme and CSS variables defining light/dark mode design tokens.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app controlling view routing, error boundaries, and transitions between marketing, shop, gallery, and product views.",
  "frontend/src/components/auth/AccessGate.tsx": "UI component showing login-required or access-denied screens using shadcn/ui cards and alerts.",
  "frontend/src/components/errors/AppErrorBoundary.tsx": "Top-level error boundary catching render failures and showing a recovery UI with reload and reset actions.",
  "frontend/src/components/marketing/About.tsx": "Displays an About section with business description paragraphs and key stats like products, customers, and support hours.",
  "frontend/src/components/marketing/Categories.tsx": "Renders a grid of product category cards with icons, titles, and descriptions.",
  "frontend/src/components/marketing/Contact.tsx": "Shows contact cards for address, phone, email, and hours plus call-to-action buttons for calling or visiting the store.",
  "frontend/src/components/marketing/Footer.tsx": "Provides a footer with brand info, social links, quick navigation links, and contact details.",
  "frontend/src/components/marketing/Header.tsx": "Implements a responsive header with logo, navigation links, view switching, and mobile menu handling.",
  "frontend/src/components/marketing/Hero.tsx": "Displays a hero section with background image, headline, description, and call and directions buttons.",
  "frontend/src/components/marketing/Services.tsx": "Shows a grid of service cards highlighting available support and offerings.",
  "frontend/src/components/navigation/InvalidStateFallback.tsx": "Fallback view showing a not-found message with a button to return to the shop.",
  "frontend/src/components/products/SafeProductImage.tsx": "Displays an image with fallback placeholder when the source is missing or fails to load.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the user’s identity, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useAdminStatus.ts": "Determines if the authenticated caller is an admin using the backend actor and React Query.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages identity loading, login, and state via Internet Identity using a React context provider.",
  "frontend/src/hooks/useProducts.ts": "Provides React Query hooks for listing, retrieving, creating, updating, and deleting products via the backend actor.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file with no queries because the backend currently has no methods.",
  "frontend/src/index.css": "Tailwind CSS setup defining light and dark theme variables and global styles.",
  "frontend/src/lib/fileToExternalBlob.ts": "Converts a File into an ExternalBlob by reading it into a byte array.",
  "frontend/src/lib/openEndWrenchBulk.ts": "Generates ProductInput objects for predefined wrench sizes using a shared image asset.",
  "frontend/src/lib/storeAddress.ts": "Exports the store address and a helper to generate its Google Maps URL.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers.",
  "frontend/src/pages/BuyProduct.tsx": "Product purchase page that loads product details, displays images, manages quantity, and provides call/email order actions.",
  "frontend/src/pages/Gallery.tsx": "Builds a product-gallery view by flattening product images and showing a preview dialog with loading and error states.",
  "frontend/src/pages/ProductManagement.tsx": "Implements admin-only product CRUD with image uploads, bulk add tools, and guarded access handling.",
  "frontend/src/pages/Shop.tsx": "Displays a product list with images, descriptions, prices, and a buy action, handling loading and empty states.",
  "frontend/src/utils/safeProduct.ts": "Provides safe accessors for product fields and image URLs, validating blobs and returning fallbacks.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, layouts, animations, and plugins for the frontend.",
  "project_state.json": "Contains project metadata, feature definitions, known issues, and architectural notes for a hardware shop website project. Indicates a fix request due to a blank-page deployment issue and lists existing functional requirements."
}