{
  "backend/main.mo": "Canister implementing access-controlled product CRUD and user profile storage using Map and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report mapping branding and hero image updates to affected frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing each frontend file's purpose across marketing, shop, and admin product management features.",
  "frontend/index.css": "Base Tailwind setup defining OKLCH color variables for light and dark themes with global background and border styles.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Top-level React component routing between marketing pages, product management, shop, and buy flow with state for selected product.",
  "frontend/src/components/auth/AccessGate.tsx": "UI component showing login-required or access-denied cards for protected product management pages.",
  "frontend/src/components/marketing/About.tsx": "Marketing About section describing the business with stats and a three-column highlights grid.",
  "frontend/src/components/marketing/Categories.tsx": "Marketing section listing six product categories with icons and descriptions in a responsive grid.",
  "frontend/src/components/marketing/Contact.tsx": "Renders a contact section showing address, phone, email, hours, and call/map buttons using cards.",
  "frontend/src/components/marketing/Footer.tsx": "Displays footer with brand info, social links, quick navigation links, and store contact details.",
  "frontend/src/components/marketing/Header.tsx": "Provides a responsive header with navigation, scroll-to-section behavior, and view-switching for different app modes.",
  "frontend/src/components/marketing/Hero.tsx": "Shows a hero banner with background image, marketing text, and call/direction buttons.",
  "frontend/src/components/marketing/Services.tsx": "Lists service offerings in a grid of cards with titles and descriptions.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on identity, initializing access control and invalidating dependent queries on change.",
  "frontend/src/hooks/useAdminStatus.ts": "Checks whether the current authenticated identity is an admin using the actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity auth state, loading identities, providing login/logout, and exposing auth context.",
  "frontend/src/hooks/useProducts.ts": "React Query hooks for listing, fetching, creating, updating, and deleting products via the backend actor.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file for future React Query hooks; currently empty.",
  "frontend/src/index.css": "TailwindCSS setup defining light/dark theme variables and global styles.",
  "frontend/src/lib/fileToExternalBlob.ts": "Converts a File into an ExternalBlob by reading it as an ArrayBuffer.",
  "frontend/src/lib/storeAddress.ts": "Stores the shop address and provides a Google Maps search URL generator.",
  "frontend/src/main.tsx": "Application entrypoint initializing React, React Query, and Internet Identity provider.",
  "frontend/src/pages/BuyProduct.tsx": "Product purchase page that loads a product, displays details, and enables phone or email ordering.",
  "frontend/src/pages/ProductManagement.tsx": "Admin interface for creating, editing, and deleting products with authentication and file uploads.",
  "frontend/src/pages/Shop.tsx": "Displays a product grid with images, descriptions, and Buy buttons using product list data.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, and persisting URL parameters across sessions.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration enabling dark mode, custom colors, animations, and typography/container-query plugins. Extends theme with OKLCH-based colors, custom radii, shadows, fonts, and accordion animations.",
  "project_state.json": "Project state file describing the website’s purpose, features, requirements, and architectural notes. Tracks schema version, implemented features, and planned admin access control."
}